rtzaudio/STC1200_TivaTM4C1294NCPDT/tcpHooks.c
/***************************************************************************
 *
 * STC-1200 Digital Search Timer Cue Controller for Ampex MM-1200.
 *
 * Copyright (C) 2016-2019, RTZ Professional Audio, LLC
 * All Rights Reserved
 *
 * RTZ is registered trademark of RTZ Professional Audio, LLC
 *
 ***************************************************************************
 *
 * Copyright (c) 2014, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ***************************************************************************/

/* XDCtools Header files */
#include <xdc/std.h>
#include <xdc/cfg/global.h>
#include <xdc/runtime/System.h>
#include <xdc/runtime/Error.h>
#include <xdc/runtime/Gate.h>
#include <xdc/runtime/Memory.h>

/* BIOS Header files */
#include <ti/sysbios/BIOS.h>
#include <ti/sysbios/knl/Semaphore.h>
#include <ti/sysbios/knl/Event.h>
#include <ti/sysbios/knl/Mailbox.h>
#include <ti/sysbios/knl/Task.h>
#include <ti/sysbios/knl/Clock.h>
#include <ti/sysbios/knl/Queue.h>
#include <ti/sysbios/gates/GateMutex.h>
#include <ti/sysbios/family/arm/m3/Hwi.h>

/* TI-RTOS Driver files */
#include <ti/drivers/GPIO.h>
#include <ti/drivers/SPI.h>
#include <ti/drivers/SDSPI.h>
#include <ti/drivers/I2C.h>
#include <ti/drivers/UART.h>

/* NDK BSD support */
#include <sys/socket.h>
//#include <ti/ndk/inc/usertype.h>

#include <file.h>
#include <stdio.h>
#include <string.h>
#include <ctype.h>
#include <stdbool.h>

#include <driverlib/sysctl.h>

/* Graphiclib Header file */
#include <grlib/grlib.h>
#include <RAMPServer.h>
#include "drivers/offscrmono.h"

/* PMX42 Board Header file */
#include "Board.h"
#include "STC1200.h"
#include "STC1200TCP.h"
#include "IPCCommands.h"
#include "IPCMessage.h"
#include "RemoteTask.h"
#include "CLITask.h"

/* Configuration Constants and Definitions */
#define NUMTCPWORKERS       4

#ifdef CYASSL_TIRTOS
#define TCPHANDLERSTACK     8704
#else
#define TCPHANDLERSTACK     1024
#endif

/* Global STC-1200 System data */
extern SYSDAT g_sys;
extern SYSCFG g_cfg;

/* Static Function Prototypes */
void netOpenHook(void);
void netIPUpdate(unsigned int IPAddr, unsigned int IfIdx, unsigned int fAdd);
Void tcpStateHandler(UArg arg0, UArg arg1);
Void tcpStateWorker(UArg arg0, UArg arg1);
Void tcpCommandHandler(UArg arg0, UArg arg1);
Void tcpCommandWorker(UArg arg0, UArg arg1);

static int ReadData(int fd, void *pbuf, int size, int flags);
static int WriteData(int fd, void *pbuf, int size, int flags);

static uint16_t HandleVersion(int fd, STC_COMMAND_VERSION* cmd);
static uint16_t HandleStop(int fd, STC_COMMAND_STOP* cmd);
static uint16_t HandleRew(int fd, STC_COMMAND_REW* cmd);
static uint16_t HandleFwd(int fd, STC_COMMAND_FWD* cmd);
static uint16_t HandlePlay(int fd, STC_COMMAND_PLAY* cmd);
static uint16_t HandleLifter(int fd, STC_COMMAND_LIFTER* cmd);
static uint16_t HandleLocateModeSet(int fd, STC_COMMAND_LOCATE_MODE_SET* cmd);
static uint16_t HandleLocate(int fd, STC_COMMAND_LOCATE* cmd);
static uint16_t HandleCuePointStore(int fd, STC_COMMAND_CUEPOINT_STORE* cmd);
static uint16_t HandleCuePointSet(int fd, STC_COMMAND_CUEPOINT_SET* cmd);
static uint16_t HandleCuePointGet(int fd, STC_COMMAND_CUEPOINT_GET* cmd);
static uint16_t HandleCuePointClear(int fd, STC_COMMAND_CUEPOINT_CLEAR* cmd);
static uint16_t HandleLocateAutoLoop(int fd, STC_COMMAND_LOCATE_AUTO_LOOP* cmd);
static uint16_t HandleAutoPunchSet(int fd, STC_COMMAND_AUTO_PUNCH_SET* cmd);
static uint16_t HandleAutoPunchGet(int fd, STC_COMMAND_AUTO_PUNCH_GET* cmd);
static uint16_t HandleTrackGetCount(int fd, STC_COMMAND_TRACK_GET_COUNT* cmd);
static uint16_t HandleTrackSetState(int fd, STC_COMMAND_TRACK_SET_STATE* cmd);
static uint16_t HandleTrackGetState(int fd, STC_COMMAND_TRACK_GET_STATE* cmd);
static uint16_t HandleTrackMaskAll(int fd, STC_COMMAND_TRACK_MASK_ALL* cmd);
static uint16_t HandleTrackModeAll(int fd, STC_COMMAND_TRACK_MODE_ALL* cmd);
static uint16_t HandleTrackToggleAll(int fd, STC_COMMAND_TRACK_TOGGLE_ALL* cmd);
static uint16_t HandleMonitor(int fd, STC_COMMAND_MONITOR* cmd);
static uint16_t HandleZeroReset(int fd, STC_COMMAND_ZERO_RESET* cmd);
static uint16_t HandleCancel(int fd, STC_COMMAND_CANCEL* cmd);
static uint16_t HandleTapeSpeedSet(int fd, STC_COMMAND_TAPE_SPEED_SET* cmd);
static uint16_t HandleConfigEPROM(int fd, STC_COMMAND_CONFIG_EPROM* cmd);
static uint16_t HandleMachineConfig(int fd, STC_COMMAND_MACHINE_CONFIG* cmd);
static uint16_t HandleMachineConfigGet(int fd, STC_COMMAND_MACHINE_CONFIG_GET* cmd);
static uint16_t HandleMachineConfigSet(int fd, STC_COMMAND_MACHINE_CONFIG_SET* cmd);

/* External Function Prototypes */
extern void NtIPN2Str(uint32_t IPAddr, char *str);

//*****************************************************************************
// Helper Functions
//*****************************************************************************

/* This function performs a blocked read for 'size' number of bytes. It will
 * continue to read until all bytes are read, or return if an error occurs.
 */

int ReadData(int fd, void *pbuf, int size, int flags)
{
    int bytesRcvd = 0;
    int bytesToRecv = size;

    uint8_t* buf = (uint8_t*)pbuf;

    do {

        if ((bytesRcvd = recv(fd, buf, bytesToRecv, 0)) <= 0)
        {
            System_printf("Error: TCP recv failed %d.\n", bytesRcvd);
            break;
        }

        bytesToRecv -= bytesRcvd;

        buf += bytesRcvd;

    } while(bytesToRecv > 0);

    return bytesRcvd;
}

