rtzaudio/STC1200_TivaTM4C1294NCPDT/tcpHooks.c
        int textlen = sizeof(STC_STATE_MSG);

        uint32_t transportMode = g_sys.transportMode;

        /* If locate is active, set search bit flag */
        if (g_sys.searching)
            transportMode |= STC_M_SEARCH;

        /* If loop mode is active, set loop mode bit flag */
        if (g_sys.autoLoop)
            transportMode |= STC_M_LOOP;

        if (g_sys.autoPunch)
            transportMode |= STC_M_PUNCH;

        int8_t tapedir = 0;

        if (g_sys.tapeTach > 0.0f)
            tapedir = (g_sys.tapeDirection > 0) ?  1 : -1;

        uint32_t maskTransport = g_sys.ledMaskTransport;

        /* Simulate tape lifter button LED active flag */
        if (g_sys.transportMode & M_LIFTER)
            maskTransport |= STC_L_LDEF;

        stateMsg.length             = textlen;
        stateMsg.errorCount         = g_sys.qei_error_cnt;
        stateMsg.ledMaskButton      = g_sys.ledMaskRemote;
        stateMsg.ledMaskTransport   = maskTransport;
        stateMsg.tapePosition       = g_sys.tapePosition;
        stateMsg.tapeVelocity       = (uint32_t)g_sys.tapeTach;
        stateMsg.transportMode      = (uint16_t)transportMode;
        stateMsg.tapeDirection      = tapedir;
        stateMsg.tapeSpeed          = (uint8_t)g_sys.tapeSpeed;
        stateMsg.tapeSize           = (uint8_t)2;
        stateMsg.searchProgress     = (uint8_t)g_sys.searchProgress;
        stateMsg.searching          = g_sys.searching;
        stateMsg.monitorFlags       = (uint8_t)g_sys.standbyMonitor;
        stateMsg.trackCount         = (uint8_t)g_sys.trackCount;
        stateMsg.reserved1          = 0;
        stateMsg.reserved2          = 0;
        stateMsg.reserved3          = 0;

        /* Copy the track state info */
        for (i=0; i < STC_MAX_TRACKS; i++)
            stateMsg.trackState[i] = g_sys.trackState[i];

        /* Copy the cue memory status bits */
        for (i=0; i < STC_MAX_CUE_POINTS; i++)
            stateMsg.cueState[i] = (uint8_t)g_sys.cuePoint[i].flags;

        /* Prepare to start sending state message buffer */

        bytesToSend = textlen;

        buf = (uint8_t*)&stateMsg;

        do {
            //if ((bytesSent = send(clientfd, buf, bytesToSend, 0)) <= 0)

            if ((bytesSent = WriteData(clientfd, buf, bytesToSend, 0)) <= 0)
            {
                connected = false;
                break;
            }

            bytesToSend -= bytesSent;

            buf += bytesSent;

        } while (bytesToSend > 0);
    }

    System_printf("tcpStateWorker DISCONNECT clientfd = 0x%x\n", clientfd);
    System_flush();

    close(clientfd);
}

//*****************************************************************************
// LISTENER CREATES COMMAND/RESPONSE WORKER TASK FOR NEW CONNECTIONS.
//*****************************************************************************

Void tcpCommandHandler(UArg arg0, UArg arg1)
{
    int                status;
    int                clientfd;
    int                server;
    struct sockaddr_in localAddr;
    struct sockaddr_in clientAddr;
    int                optval;
    int                optlen = sizeof(optval);
    socklen_t          addrlen = sizeof(clientAddr);
    Task_Handle        taskHandle;
    Task_Params        taskParams;
    Error_Block        eb;

    server = socket(AF_INET, SOCK_STREAM, IPPROTO_TCP);

    if (server == -1)
    {
        System_printf("Error: socket not created.\n");
        goto shutdown;
    }

    memset(&localAddr, 0, sizeof(localAddr));

    localAddr.sin_family      = AF_INET;
    localAddr.sin_addr.s_addr = htonl(INADDR_ANY);
    localAddr.sin_port        = htons(arg0);

    status = bind(server, (struct sockaddr *)&localAddr, sizeof(localAddr));

    if (status == -1)
    {
        System_printf("Error: bind failed.\n");
        goto shutdown;
    }

    status = listen(server, NUMTCPWORKERS);

    if (status == -1)
    {
        System_printf("Error: listen failed.\n");
        goto shutdown;
    }

    optval = 100;

    if (setsockopt(server, SOL_SOCKET, SO_KEEPALIVE, &optval, optlen) < 0)
    {
        System_printf("Error: setsockopt failed\n");
        goto shutdown;
    }

    while ((clientfd = accept(server, (struct sockaddr *)&clientAddr, &addrlen)) != -1)
    {
        //System_printf("tcpStateHandler: Creating thread clientfd = %d\n", clientfd);
        //System_flush();

        /* Init the Error_Block */
        Error_init(&eb);

        /* Initialize the defaults and set the parameters. */
        Task_Params_init(&taskParams);
        taskParams.arg0      = (UArg)clientfd;
        taskParams.stackSize = 1280;
        taskParams.priority  = 5;

        taskHandle = Task_create((Task_FuncPtr)tcpCommandWorker, &taskParams, &eb);

        if (taskHandle == NULL)
        {
            //System_printf("Error: Failed to create new Task\n");
            //System_flush();
            close(clientfd);
        }

        /* addrlen is a value-result param, must reset for next accept call */
        addrlen = sizeof(clientAddr);
    }

    System_printf("Exiting TCP command listener task\n");
    System_flush();

shutdown:

    System_flush();

    if (server > 0)
    {
        close(server);
    }
}

//*****************************************************************************
// HANDLES COMMAND/RESPONSE REQUESTS FROM CLIENT. THERE CAN BE MULTIPLE
// COMMAND HANDLER WORKER THREADS RUNNING.
//*****************************************************************************

#define RXBUF_SIZE  512

Void tcpCommandWorker(UArg arg0, UArg arg1)
{
    bool        connected = true;
    bool        notify;
    int         clientfd = (int)arg0;
    int         bytesSent;
    int         bytesRcvd;
    uint16_t    status;
    uint8_t*    buf;
    Error_Block eb;
    STC_COMMAND_HDR* hdr;

    Error_init(&eb);

    if ((buf = Memory_alloc(NULL, RXBUF_SIZE, NULL, &eb)) == NULL)
    {
        System_printf("tcpCommandWorker: OUT OF MEMORY 0x%x\n", clientfd);
        System_flush();
        return;
    }

    System_printf("tcpCommandWorker: CONNECT clientfd = 0x%x\n", clientfd);
    System_flush();

    while (connected)
    {
        /* Attempt to read a message header */
        bytesRcvd = ReadData(clientfd, buf, sizeof(STC_COMMAND_HDR), 0);

        if (bytesRcvd <= 0)
        {
            System_printf("Error: TCP read error %d.\n", bytesRcvd);
            System_flush();
            connected = FALSE;
            break;
        }

        /* First part of message is always the header struct data */
        hdr = (STC_COMMAND_HDR*)buf;

        /* Make sure our buffer can hold the message */
        if (hdr->length >= RXBUF_SIZE)
        {
            System_printf("Error: buffer size too small to handle %d bytes.\n", hdr->length);
            System_flush();
            continue;
        }

        /* Attempt to read the rest of the message following the header */
        bytesRcvd = ReadData(
                clientfd,
                buf + sizeof(STC_COMMAND_HDR),
                hdr->length - sizeof(STC_COMMAND_HDR),
                0);

        if (bytesRcvd <= 0)
        {
            System_printf("Error: TCP read error %d.\n", bytesRcvd);
            System_flush();
            connected = FALSE;
            break;
        }

