rtzaudio/STC1200_TivaTM4C1294NCPDT/tcpHooks.c
        /*
         * Determine which command to process from the client
         */

        notify = false;

        switch(hdr->command)
        {

        case STC_CMD_VERSION:
            status = HandleVersion(clientfd, (STC_COMMAND_VERSION*)buf);
            break;

        case STC_CMD_STOP:
            status = HandleStop(clientfd, (STC_COMMAND_STOP*)buf);
            break;

        case STC_CMD_PLAY:
            status = HandlePlay(clientfd, (STC_COMMAND_PLAY*)buf);
            break;

        case STC_CMD_REW:
            status = HandleRew(clientfd, (STC_COMMAND_REW*)buf);
            break;

        case STC_CMD_FWD:
            status = HandleFwd(clientfd, (STC_COMMAND_FWD*)buf);
            break;

        case STC_CMD_LIFTER:
            status = HandleLifter(clientfd, (STC_COMMAND_LIFTER*)buf);
            break;

        case STC_CMD_LOCATE:
            status = HandleLocate(clientfd, (STC_COMMAND_LOCATE*)buf);
            break;

        case STC_CMD_LOCATE_AUTO_LOOP:
            status = HandleLocateAutoLoop(clientfd, (STC_COMMAND_LOCATE_AUTO_LOOP*)buf);
            break;

        case STC_CMD_LOCATE_MODE_SET:
            status = HandleLocateModeSet(clientfd, (STC_COMMAND_LOCATE_MODE_SET*)buf);
            break;

        case STC_CMD_AUTO_PUNCH_SET:
            status = HandleAutoPunchSet(clientfd, (STC_COMMAND_AUTO_PUNCH_SET*)buf);
            notify = TRUE;
            break;

        case STC_CMD_AUTO_PUNCH_GET:
            status = HandleAutoPunchGet(clientfd, (STC_COMMAND_AUTO_PUNCH_GET*)buf);
            break;

        case STC_CMD_CUEPOINT_CLEAR:
            status = HandleCuePointClear(clientfd, (STC_COMMAND_CUEPOINT_CLEAR*)buf);
            notify = true;
            break;

        case STC_CMD_CUEPOINT_STORE:
            status = HandleCuePointStore(clientfd, (STC_COMMAND_CUEPOINT_STORE*)buf);
            notify = true;
            break;

        case STC_CMD_CUEPOINT_SET:
            status = HandleCuePointSet(clientfd, (STC_COMMAND_CUEPOINT_SET*)buf);
            notify = true;
            break;

        case STC_CMD_CUEPOINT_GET:
            status = HandleCuePointGet(clientfd, (STC_COMMAND_CUEPOINT_GET*)buf);
            break;

        case STC_CMD_TRACK_TOGGLE_ALL:
            status = HandleTrackToggleAll(clientfd, (STC_COMMAND_TRACK_TOGGLE_ALL*)buf);
            break;

        case STC_CMD_TRACK_SET_STATE:
            status = HandleTrackSetState(clientfd, (STC_COMMAND_TRACK_SET_STATE*)buf);
            break;

        case STC_CMD_TRACK_GET_STATE:
            status = HandleTrackGetState(clientfd, (STC_COMMAND_TRACK_GET_STATE*)buf);
            break;

        case STC_CMD_TRACK_MASK_ALL:
            status = HandleTrackMaskAll(clientfd, (STC_COMMAND_TRACK_MASK_ALL*)buf);
            break;

        case STC_CMD_TRACK_MODE_ALL:
            status = HandleTrackModeAll(clientfd, (STC_COMMAND_TRACK_MODE_ALL*)buf);
            break;

        case STC_CMD_ZERO_RESET:
            status = HandleZeroReset(clientfd, (STC_COMMAND_ZERO_RESET*)buf);
            notify = true;
            break;

        case STC_CMD_CANCEL:
            status = HandleCancel(clientfd, (STC_COMMAND_CANCEL*)buf);
            break;

        case STC_CMD_TAPE_SPEED_SET:
            status = HandleTapeSpeedSet(clientfd, (STC_COMMAND_TAPE_SPEED_SET*)buf);
            break;

        case STC_CMD_CONFIG_EPROM:
            status = HandleConfigEPROM(clientfd, (STC_COMMAND_CONFIG_EPROM*)buf);
            break;

        case STC_CMD_MONITOR:
            status = HandleMonitor(clientfd, (STC_COMMAND_MONITOR*)buf);
            notify = true;
            break;

        case STC_CMD_TRACK_GET_COUNT:
            status = HandleTrackGetCount(clientfd, (STC_COMMAND_TRACK_GET_COUNT*)buf);
            break;

        case STC_CMD_MACHINE_CONFIG:
            status = HandleMachineConfig(clientfd, (STC_COMMAND_MACHINE_CONFIG*)buf);
            break;

        case STC_CMD_MACHINE_CONFIG_GET:
            status = HandleMachineConfigGet(clientfd, (STC_COMMAND_MACHINE_CONFIG_GET*)buf);
            break;

        case STC_CMD_MACHINE_CONFIG_SET:
            status = HandleMachineConfigSet(clientfd, (STC_COMMAND_MACHINE_CONFIG_SET*)buf);
            break;

        default:
            break;
        }

        /* Send the response packet */

        bytesSent =  WriteData(clientfd, buf, hdr->length, 0);

        if (bytesSent <= 0)
        {
            System_printf("Error: TCP write error %d.\n", bytesSent);
            System_flush();
            connected = false;
            break;
        }

        /* Refresh transport state change to DRC1200 wired remote */
        if (notify)
            Event_post(g_eventTransport, Event_Id_03);

        (void)status;
    }

    /* Close the TCP handle */
    close(clientfd);

    /* Free rx buffer memory allocated */
    Memory_free(NULL, buf, RXBUF_SIZE);

    /* Debugger Message */
    System_printf("tcpCommandWorker DISCONNECT clientfd = 0x%x\n", clientfd);
    System_flush();
}

//*****************************************************************************
// COMMAND MESSAGE HANDLERS
//*****************************************************************************

uint16_t HandleVersion(int fd, STC_COMMAND_VERSION* cmd)
{
    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_VERSION);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

    /* Reply Message Data */
    cmd->arg.param1.U = MAKEREV(FIRMWARE_VER, FIRMWARE_REV);
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleStop(int fd, STC_COMMAND_STOP* cmd)
{
    /* Cancel an locate in progress */
    if (IsLocating())
        LocateCancel();

    /* Send STOP button press */
    Transport_PostButtonPress(S_STOP);

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_STOP);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

