rtzaudio/STC1200_TivaTM4C1294NCPDT/tcpHooks.c
    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleTapeSpeedSet(int fd, STC_COMMAND_TAPE_SPEED_SET* cmd)
{
    /* Set transport tape speed */
    Track_SetTapeSpeed((int)cmd->arg.param1.U);

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_TAPE_SPEED_SET);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleConfigEPROM(int fd, STC_COMMAND_CONFIG_EPROM* cmd)
{
    /* param1: 0=load, 1=store, 3=reset
     * param2 = 0
     */
    switch(cmd->arg.param1.U)
    {
    case 0:
        ConfigLoad(1);
        break;

    case 1:
        ConfigSave(1);
        break;

    case 3:
        ConfigReset(1);
        break;

    default:
        break;
    }

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_CONFIG_EPROM);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleMonitor(int fd, STC_COMMAND_MONITOR* cmd)
{
    /* Enable standby monitor mode for all tracks */
    g_sys.standbyMonitor = (cmd->arg.param1.U) ? true : false;

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_MONITOR);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleTrackGetCount(int fd, STC_COMMAND_TRACK_GET_COUNT* cmd)
{
    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_TRACK_GET_COUNT);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

    /* Reply Message Data */
    cmd->arg.param1.U = g_sys.trackCount;
    cmd->arg.param2.U = g_sys.dcsFound;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleMachineConfig(int fd, STC_COMMAND_MACHINE_CONFIG* cmd)
{
    /* This allows the STC to tell the DTC to load, store or
     * reset it configuration parameters to/from EPROM
     */
    switch(cmd->arg.param1.U)
    {
    case 0:         /* load DTC config */
        break;

    case 1:         /* store DTC config */
        break;

    case 2:         /* reset DTC config */
        break;

    default:
        break;
    }

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_MACHINE_CONFIG);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleMachineConfigGet(int fd, STC_COMMAND_MACHINE_CONFIG_GET* cmd)
{
    /* Gets the STC and DTC configuration parameters struct in memory */
    memset(&(cmd->stc), 0, sizeof(STC_CONFIG_DATA));
    memset(&(cmd->dtc), 0, sizeof(DTC_CONFIG_DATA));

    if (sizeof(STC_CONFIG_DATA) == sizeof(SYSCFG))
    {
        /* Copy STC global system config data into message buffer */
        memcpy(&(cmd->stc), &g_cfg, sizeof(STC_CONFIG_DATA));
    }

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_MACHINE_CONFIG_GET);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleMachineConfigSet(int fd, STC_COMMAND_MACHINE_CONFIG_SET* cmd)
{
    /* Sets the STC and DTC configuration parameters in memory */

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_MACHINE_CONFIG_SET);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return 0;
}

// End-Of-File
